uhnp/src/Catalogs/ВидыОпераций/ВидыОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыОпераций</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВнеоборотныеАктивы</name>
      <description>Внеоборотные активы</description>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>ВнутригрупповыеОперации</name>
      <description>Внутригрупповые операции</description>
    </items>
    <items>
      <name>Консолидация</name>
      <description>Консолидационные поправки</description>
    </items>
    <items>
      <name>НачислениеОпераций</name>
      <description>Начисление операций</description>
    </items>
    <items>
      <name>ОборотныеАктивы</name>
      <description>Оборотные активы</description>
    </items>
    <items>
      <name>ПовторыКорректировок</name>
      <description>Повторы корректировок</description>
    </items>
    <items>
      <name>РегламентныеОперации</name>
      <description>Регламентные операции</description>
    </items>
    <items>
      <name>Резервы</name>
      <description>Резервы</description>
    </items>
    <items>
      <name>ФинансовыеИнструменты</name>
      <description>Финансовые инструменты</description>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
      </content>
    </items>
    <items>
      <name>КорректировкаПрибыли</name>
      <description>Корректировка прибыли (AJE)</description>
    </items>
    <items>
      <name>ОперацииДляЦелейОтчетности</name>
      <description>Операции для целей отчетности (признание и сторно)</description>
    </items>
    <items>
      <name>Трансляция</name>
      <description>Трансляция</description>
    </items>
    <items>
      <name>УчетныеОперации</name>
      <description>Учетные операции</description>
    </items>
  </predefined>
</mdclass:Catalog>

uhnp/src/Catalogs/ВидыОпераций/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьВидыОперацииПовтора() Экспорт

	ОперацииПовтора = Новый Массив;
	
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.ПовторКорректировокПредыдущихПериодов);
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.ПовторКорректировокДействиеПовтора);
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.СторноКорректировокОтчетности);	
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.ПовторРеклассаСчетовВНА);
	ОперацииПовтора.Добавить(Справочники.ВидыОпераций.ПовторПроводокПоКонсолидационнымПоправкам);
	
	Возврат ОперацииПовтора;
	
КонецФункции

Функция ЯвляетсяОперациейПовтора(ВидОперации) Экспорт

	Возврат ПолучитьВидыОперацииПовтора().Найти(ВидОперации) <> Неопределено;

КонецФункции

#Область ВНА

Функция ПолучитьВидыСобытийВНАПоДокументам() Экспорт

	СобытияДокументов = Новый Структура;
		
	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ПринятиеКУчетуВНА);
	СобытияДокументов.Вставить("ПоступлениеВНАМСФО", СобытияВНА);
	
	СобытияДокументов.Вставить("ВводВНАВЭксплуатациюМСФО", ПолучитьСобытия_ВводВНАВЭксплуатациюМСФО());
	СобытияДокументов.Вставить("МодернизацияВНАМСФО", ПолучитьСобытия_МодернизацияВНАМСФО());
	
	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ИзменениеПараметровАмортизации);
	СобытияДокументов.Вставить("ИзменениеПараметровВНАМСФО", СобытияВНА);

	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.СторноАмортизацииНСБУ);
	СобытияДокументов.Вставить("ПризнаниеРасходовПоАмортизацииНСБУ", СобытияВНА);	
	
	СобытияДокументов.Вставить("ВыбытиеВНАМСФО", ПолучитьСобытия_ВыбытиеВНАМСФО());
	
	СобытияДокументов.Вставить("ПереоценкаВНАМСФО", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыОпераций.ПереоценкаВНА));
	СобытияДокументов.Вставить("ОбесценениеВНАМСФО", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Справочники.ВидыОпераций.ОбесценениеВНА));

	Возврат СобытияДокументов;

КонецФункции

Функция ПолучитьСобытия_ВводВНАВЭксплуатациюМСФО() Экспорт
	 	
	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ВводВЭксплуатацию);
	
	Возврат СобытияВНА;
	
КонецФункции

Функция ПолучитьСобытия_МодернизацияВНАМСФО() Экспорт

	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.МодернизацияВНА);
	
	Возврат СобытияВНА;

КонецФункции

Функция ПолучитьСобытия_ВыбытиеВНАМСФО() Экспорт

	СобытияВНА = Новый Массив;
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ПередачаВНА);
	СобытияВНА.Добавить(Справочники.ВидыОпераций.ВыбытиеВНА);
	СобытияВНА.Добавить(Справочники.ВидыОпераций.СписаниеВНА);

	Возврат СобытияВНА;

КонецФункции

#КонецОбласти

#Область ОбновлениеПредопределенных

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения:
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Истина;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов справочника.
//  ТабличныеЧасти - Структура из КлючИЗначение - данные заполнения табличных частей.
//                                                Состав колонок соответствует набору реквизитов табличных частей.
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти) Экспорт

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УчетныеОперации";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Учетные операции'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000001";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КорректировкаПрибыли";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Корректировка прибыли (AJE)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000004";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Трансляция";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Трансляция'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000005";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОперацииДляЦелейОтчетности";
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Операции для целей отчетности (признание и сторно)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000016";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПередачаВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Передача (продажа) ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005013";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаАмортизацииПропорционально";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка амортизации пропорционально'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005014";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаСписаниеАмортизации";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка: списание амортизации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005015";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаДооценка";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка: дооценка'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005016";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаКорректировкаУценки";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка: корректировка уценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005017";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаКорректировкаДооценки";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка: корректировка дооценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005018";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаУценка";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка: уценка'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005019";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005071";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаВыбытиеПереоценки";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииПереоценкиВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка: выбытие переоценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005093";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПовторРеклассаСчетовВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Повтор рекласса счетов ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000026";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачислениеАмортизацииНСБУ";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начисление амортизации НСБУ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005003";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноАмортизацииНСБУ";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно амортизации НСБУ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005004";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "МодернизацияВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Модернизация ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005007";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ИзменениеПараметровАмортизации";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Изменение параметров амортизации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005008";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачислениеАмортизации";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начисление амортизации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005009";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачальныеОстаткиВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начальные остатки ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005022";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПринятиеКУчетуВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Принятие к учету ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005023";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВводВЭксплуатацию";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Ввод в эксплуатацию'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005040";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноСписанияАктива";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнеоборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно списания актива'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000010002";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыбытиеВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииВыбытияВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Выбытие ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005091";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СписаниеВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииВыбытияВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Списание ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005092";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыбытиеАмортизации";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииВыбытияВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Выбытие амортизации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005095";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОбесценениеВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииОбесцененияВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Обесценение ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005081";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОбесценениеДооценкаУбытка";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииОбесцененияВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Обесценение: дооценка убытка'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005082";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОбесценениеУбыток";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииОбесцененияВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Обесценение: убыток'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005083";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ОбесценениеВыбытиеОбесценения";
	Элемент.Родитель = Справочники.ВидыОпераций.ОперацииОбесцененияВНА;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Обесценение: выбытие обесценения'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005094";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыбытиеФИ";
	Элемент.Родитель = Справочники.ВидыОпераций.Выбытие;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Выбытие финансового инструмента'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004146";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыбытиеПереоценкиФИ";
	Элемент.Родитель = Справочники.ВидыОпераций.Выбытие;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Выбытие накопленной переоценки финансового инструмента'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004401";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АмортизацияПоправки";
	Элемент.Родитель = Справочники.ВидыОпераций.Дисконт;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Амортизация дисконта (поправки)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004501";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноАмортизацияПоправки";
	Элемент.Родитель = Справочники.ВидыОпераций.Дисконт;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно амортизация поправки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004502";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачислениеДисконтаФИ";
	Элемент.Родитель = Справочники.ВидыОпераций.Дисконт;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начисление дисконта'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004512";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Платеж";
	Элемент.Родитель = Справочники.ВидыОпераций.Оплата;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Платеж'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004701";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереносОплаты";
	Элемент.Родитель = Справочники.ВидыОпераций.Оплата;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Перенос оплаты'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004702";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПогашениеОсновногоДолга";
	Элемент.Родитель = Справочники.ВидыОпераций.Оплата;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Погашение основного долга'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004703";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПогашениеПроцентов";
	Элемент.Родитель = Справочники.ВидыОпераций.Оплата;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Погашение процентов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004704";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереносНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.Оплата;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Перенос НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000010008";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПоступлениеОтПоставщика";
	Элемент.Родитель = Справочники.ВидыОпераций.ОборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Поступление от поставщика'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000002012";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НДСПолученный";
	Элемент.Родитель = Справочники.ВидыОпераций.ОборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'НДС полученный'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000002014";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СписаниеСтоимости";
	Элемент.Родитель = Справочники.ВидыОпераций.ОборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Списание стоимости'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000002022";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыручкаОтПродажи";
	Элемент.Родитель = Справочники.ВидыОпераций.ОборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Выручка от продажи'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000002024";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НДСРеализации";
	Элемент.Родитель = Справочники.ВидыОпераций.ОборотныеАктивы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'НДС реализации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000002026";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачислениеДоходовРасходовМСФО";
	Элемент.Родитель = Справочники.ВидыОпераций.НачислениеОпераций;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начисление доходов расходов МСФО'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000014";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноНачисленияДоходовРасходовМСФО";
	Элемент.Родитель = Справочники.ВидыОпераций.НачислениеОпераций;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно начисления доходов расходов МСФО'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005001";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "АвансПоНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.ДКЗ;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Аванс по НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000010005";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СписаниеАвансаПоНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.ДКЗ;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Списание аванса по НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000010006";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДополнительныеРасходыСумма";
	Элемент.Родитель = Справочники.ВидыОпераций.ДополнительныеРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Восстановление дополнительного расхода, сумма без НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004201";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ДополнительныеРасходыНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.ДополнительныеРасходы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Восстановление дополнительного расхода, НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004202";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КорректировкаИсходныхДанныхПриУрегулировании";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнутригрупповыеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Корректировка исходных данных при урегулировании ВГО'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000001002";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачислениеОперацийПриУрегулировании";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнутригрупповыеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начисление операций при урегулировании ВГО'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000001005";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СписаниеРасхожденияВГО";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнутригрупповыеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Списание расхождения ВГО'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000001006";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УрегулированиеРасхожденияВГО";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнутригрупповыеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Урегулирование расхождения ВГО'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000001007";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЭлиминацияОперацийА";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнутригрупповыеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Элиминация операций А'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000001009";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЭлиминацияВГО";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнутригрупповыеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Элиминация ВГО'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000001017";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЭлиминацияОперацийБ";
	Элемент.Родитель = Справочники.ВидыОпераций.ВнутригрупповыеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Элиминация операций Б'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000010010";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВосстановлениеДополнительногоРасхода";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Восстановление дополнительного расхода'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004003";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереводОбъектаНаСчетУчета";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Перевод объекта на счет учета'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004109";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПризнаниеДЗ";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Признание ДЗ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004113";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПризнаниеПриРеструктуризации";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Признание при реструктуризации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004114";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПризнаниеПроцентов";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Признание процентов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004115";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РеклассНачисленныхПроцентовНСБУ";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Рекласс начисленных процентов НСБУ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004119";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноПроцентов";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно данных НСБУ '", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004129";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРекласса";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно рекласса'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004133";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПризнаниеФИ";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Признание финансового инструмента'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004145";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РеклассФИ";
	Элемент.Родитель = Справочники.ВидыОпераций.ФинансовыеИнструменты;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Реклассификация финансового инструмента'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004402";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КонсолидационныеПоправки";
	Элемент.Родитель = Справочники.ВидыОпераций.Консолидация;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Консолидационные поправки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000019";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "БудущиеНеначисленныеДоходыРасходы";
	Элемент.Родитель = Справочники.ВидыОпераций.РеклассыДляОтчетности;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Будущие неначисленные доходы расходы'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004002";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РаскрытиеСправедливойСтоимости";
	Элемент.Родитель = Справочники.ВидыОпераций.РеклассыДляОтчетности;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Раскрытие справедливой стоимости'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004117";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РеклассификацияДолгосрочнойЗадолженности";
	Элемент.Родитель = Справочники.ВидыОпераций.РеклассыДляОтчетности;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Реклассификация краткосрочной задолженности'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004118";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РеклассПоИнтервалам";
	Элемент.Родитель = Справочники.ВидыОпераций.РеклассыДляОтчетности;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Рекласс по интервалам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004120";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноБудущихНеначисленныхДоходовРасходов";
	Элемент.Родитель = Справочники.ВидыОпераций.РеклассыДляОтчетности;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно будущих неначисленных доходов расходов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004122";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРаскрытияСправедливойСтоимости";
	Элемент.Родитель = Справочники.ВидыОпераций.РеклассыДляОтчетности;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно раскрытия справедливой стоимости'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004131";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРеклассаПоИнтервалам";
	Элемент.Родитель = Справочники.ВидыОпераций.РеклассыДляОтчетности;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно рекласса по интервалам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004134";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРеклассификацииДолгосрочнойЗадолженности";
	Элемент.Родитель = Справочники.ВидыОпераций.РеклассыДляОтчетности;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно реклассификации долгосрочной задолженности'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004136";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноПриРеструктуризации";
	Элемент.Родитель = Справочники.ВидыОпераций.Реструктуризация;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно при реструктуризации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004128";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗакрытиеПериода";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Закрытие периода (CO)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000002";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "_01РеклассАПСчетов";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Рекласс активно-пассивные счетов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000008";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "_02ПереоценкаВалютныхАктивовИОбязательств";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка валютных активов и обязательств'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000009";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "_03РасчетСебестоимости";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Расчет себестоимости'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000010";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "_04РасчетОтложенныхНалогов";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Расчет отложенных налогов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000011";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "_05РасчетФинансовогоРезультата";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Расчет финансового результата'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000012";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "_06РеформацияБаланса";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Реформация баланса'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000013";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КорректировкаЗатратАмортизации";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Корректировка затрат амортизации'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000015";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КорректировкиПоВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Корректировки по внеоборотным активам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000021";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "КорректировкиПоФИ";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Корректировки по финансовым инструментам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000022";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РасчетОтложенныхНалоговКонсолидация";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Расчет отложенных налогов (консолидация)'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000024";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРасчетаОтложенныхНалогов";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно расчета отложенных налогов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000025";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереоценкаФИ";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Переоценка финансовых инструментов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000027";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереносПредыдущейНРП";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Перенос нераспределенной прибыли предыдущего период'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000005096";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РеклассОтложенныхНалогов";
	Элемент.Родитель = Справочники.ВидыОпераций.РегламентныеОперации;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Рекласс отложенных налогов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000010001";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПовторКорректировокПредыдущихПериодов";
	Элемент.Родитель = Справочники.ВидыОпераций.ПовторыКорректировок;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Повтор корректировок предыдущих периодов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000003";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПовторПроводокПоКонсолидационнымПоправкам";
	Элемент.Родитель = Справочники.ВидыОпераций.ПовторыКорректировок;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Повтор проводок по консолидационным поправкам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000020";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноКорректировокОтчетности";
	Элемент.Родитель = Справочники.ВидыОпераций.ПовторыКорректировок;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно корректировок отчетности'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000028";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПовторКорректировокДействиеПовтора";
	Элемент.Родитель = Справочники.ВидыОпераций.ПовторыКорректировок;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Повтор корректировок с указанным действием повтора'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000029";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РезервыПоДЗИАвансамВыданным";
	Элемент.Родитель = Справочники.ВидыОпераций.Резервы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Резервы по ДЗ и Авансам выданным'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000018";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РезервыПоМПЗ";
	Элемент.Родитель = Справочники.ВидыОпераций.Резервы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Резервы по запасам'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000000023";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РезервПоПретензиям";
	Элемент.Родитель = Справочники.ВидыОпераций.Резервы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Резерв по претензиям'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004403";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРезерваПоПретензиям";
	Элемент.Родитель = Справочники.ВидыОпераций.Резервы;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно резерва по претензиям'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004404";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноПереоценки";
	Элемент.Родитель = Справочники.ВидыОпераций.Переоценка;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно переоценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004126";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗачетПервоначальногоАвансаНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Зачет первоначального аванса НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004101";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ЗачетПервоначальногоАвансаСуммаБезНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Зачет первоначального аванса сумма без НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004102";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачислениеАвансовогоПлатежа";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начисление авансового платежа'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004103";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачислениеЛизинговогоПлатежа";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начисление лизингового платежа'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004104";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачислениеПлатежаПоНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начисление платежа по НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004105";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НеттингНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Неттинг НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004106";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереводВКраткосрочныеЗадолженностиПоНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Перевод в краткосрочные задолженности по НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004107";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереводНДСВПрочуюДЗ";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Перевод НДСВПрочую ДЗ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004108";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РаскрытиеМинимальныхПлатежей";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Раскрытие минимальных платежей'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004116";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноДБПНачисленныхВНСБУ";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно ДБПНачисленных ВНСБУ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004124";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноНеттингаНДС";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно неттинга НДС'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004125";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРаскрытияМинимальныхПлатежей";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно раскрытия минимальных платежей'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004130";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРасходовПоВыбытиюВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно расходов по выбытию ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004132";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РаскрытиеЧистыеИнвестиции";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Раскрытие чистые инвестиции'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004137";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноРаскрытияЧистыхИнвестиций";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно раскрытия чистых инвестиций'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004138";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПризнаниеФинансовыхДоходов";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Признание финансовых доходов'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004139";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "НачисленНДСКУплатеВБюджет";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Начислен НДСКУплате в бюджет'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004140";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СписаныЧИЛ";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Списаны ЧИЛ'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004141";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СторноДоходовПоВыбытиюВНА";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Сторно доходов по выбытию ВНА'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004142";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПереводНеоплаченнойЗадолженности";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Перевод неоплаченной задолженности'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004143";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "СписаниеПереоценки";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Списание переоценки'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004144";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УвеличениеЛизинга";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Увеличение балансовой стоимости лизинга'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004170";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "УменьшениеЛизинга";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Уменьшение балансовой стоимости лизинга'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004175";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВозвратОбъектаЛизинга";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Возврат объекта лизинга арендодателю'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000004180";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ВыделениеНеарендногоКомпонента";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Выделение неаредного компонента платежа'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000010003";

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПризнаниеИнвестицийВАренду";
	Элемент.Родитель = Справочники.ВидыОпераций.Лизинг;
	ДополнительныеЯзыкиУХ.ЗаполнитьМультиязычныйРеквизит(Элемент, "Наименование", "ru = 'Признание инвестиций в аренду'", КодыЯзыков); // @NStr-2
	Элемент.Код = "000010007";

КонецПроцедуры

// Вызывается при начальном заполнении создаваемого элемента.
//
// Параметры:
//  Объект                  - СправочникОбъект.НастройкиХозяйственныхОпераций - заполняемый объект.
//  Данные                  - СтрокаТаблицыЗначений - данные заполнения.
//  ДополнительныеПараметры - Структура - Дополнительные параметры.
//
Процедура ПриНачальномЗаполненииЭлемента(Объект, Данные, ДополнительныеПараметры) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
